---
type: AlignmentStationLabelOptions
namespace: Autodesk.Revit.DB.Infrastructure
version: 2024
members: 6
tags: [revit-api, class]
---

# AlignmentStationLabelOptions

`Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AlignmentStationLabelOptions | 2021.1 | `public AlignmentStationLabelOptions ( double station )` |
| Property | HasLeader | 2021.1 | `public bool HasLeader { get ; set ; }` |
| Property | LeaderEnd | 2021.1 | `public XYZ LeaderEnd { get ; set ; }` |
| Property | LeaderShoulder | 2021.1 | `public XYZ LeaderShoulder { get ; set ; }` |
| Property | Station | 2021.1 | `public double Station { get ; set ; }` |
| Property | TypeId | 2021.1 | `public ElementId TypeId { get ; set ; }` |